In [68]:
import pandas as pd

emp=pd.read_csv('employee.csv')
emp.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,06:53,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17,130590,11.858,False,Finance
3,Jerry,Male,3/4/2005,13:00,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,16:47,101004,1.389,True,Client Services

In [69]:
emp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    object
 1   Gender             855 non-null    object
 2   Start Date         1000 non-null   object
 3   Last Login Time    1000 non-null   object
 4   Salary             1000 non-null   int64
 5   Bonus %            1000 non-null   float64
 6   Senior Management  933 non-null    object
 7   Team               957 non-null    object
dtypes: float64(1), int64(1), object(6)
memory usage: 62.6+ KB

In [70]:
emp["Start Date"].head()

0     8/6/1993
1    3/31/1996
2    4/23/1993
3     3/4/2005
4    1/24/1998
Name: Start Date, dtype: object

In [71]:
emp["Start Date"]=pd.to_datetime(emp["Start Date"])
emp["Start Date"]

0     1993-08-06
1     1996-03-31
2     1993-04-23
3     2005-03-04
4     1998-01-24
         ...
995   2014-11-23
996   1984-01-31
997   2013-05-20
998   2013-04-20
999   2012-05-15
Name: Start Date, Length: 1000, dtype: datetime64[ns]

In [72]:
emp['Last Login Time'].head()

0    12:42
1    06:53
2    11:17
3    13:00
4    16:47
Name: Last Login Time, dtype: object

In [73]:
emp['Last Login Time']=pd.to_datetime(emp['Last Login Time'])
emp['Last Login Time'].head()

0   2022-06-04 12:42:00
1   2022-06-04 06:53:00
2   2022-06-04 11:17:00
3   2022-06-04 13:00:00
4   2022-06-04 16:47:00
Name: Last Login Time, dtype: datetime64[ns]

In [74]:
emp['Senior Management'].head()

0     True
1     True
2    False
3     True
4     True
Name: Senior Management, dtype: object

In [75]:
emp['Senior Management'].astype('bool')
emp['Senior Management']=emp['Senior Management'].astype('bool')

In [76]:
emp['Gender'].astype('category')
emp['Gender']=emp['Gender'].astype('category')

In [77]:
emp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    object
 1   Gender             855 non-null    category
 2   Start Date         1000 non-null   datetime64[ns]
 3   Last Login Time    1000 non-null   datetime64[ns]
 4   Salary             1000 non-null   int64
 5   Bonus %            1000 non-null   float64
 6   Senior Management  1000 non-null   bool
 7   Team               957 non-null    object
dtypes: bool(1), category(1), datetime64[ns](2), float64(1), int64(1), object(2)
memory usage: 49.1+ KB